БИТУправление_медицинским_центром_демо/src/InformationRegisters/КешИнформацииОбОбъектах/КешИнформацииОбОбъектах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КешИнформацииОбОбъектах</name>
  <resources>
    <name>ЕстьЗадачи</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПроверкиЭП</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ЕстьКатегории</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЕстьОшибкиПриемкиОтправкиПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЕстьФайлы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтправленОтвет</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Отозван</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Переслан</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Перенаправлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПолученОтвет</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПолученПоСВД</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеСВД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СостояниеКонтроля</name>
    <type>
      <types>EnumRef.СостоянияКонтроля</types>
    </type>
  </resources>
  <resources>
    <name>СтатусЭП</name>
    <type>
      <types>EnumRef.СтатусПроверкиЭП</types>
    </type>
  </resources>
  <resources>
    <name>СрокИсполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокИсполненияОбщий</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаИсполнения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ВероятностьКТ</name>
    <type>
      <types>EnumRef.ВероятностиКТ</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.ПодписанныйОбъект</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/Enums/СостоянияНеотправленныхДокументов/СостоянияНеотправленныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияНеотправленныхДокументов</name>
  <enumValues>
    <name>ДокументыБезСообщений</name>
  </enumValues>
  <enumValues>
    <name>ДокументыБезВсехПодписей</name>
  </enumValues>
  <enumValues>
    <name>ДокументыСНесформированнымиФайламиРЭМД</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Enums/СтатусПроверкиЭП/СтатусПроверкиЭП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусПроверкиЭП</name>
  <enumValues>
    <name>ПодписьДействительна</name>
  </enumValues>
  <enumValues>
    <name>ПодписьНедействительна</name>
  </enumValues>
  <enumValues>
    <name>ПодписьНеПроверена</name>
  </enumValues>
  <enumValues>
    <name>ПодписиНет</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/CommonForms/КонтрольЗаСообщениямиРЭМД/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Состояние") Тогда
		Если Параметры.Состояние = Перечисления.СостоянияНеотправленныхДокументов.ДокументыБезСообщений Тогда
			ТекстЗапросаДокументов = ИнтеграцияЕГИСЗ_РЭМД.ТекстЗапросаДокументыБезСообщений();
			ЭтотОбъект.Заголовок = НСтр("ru='Документы без сообщений'");
		ИначеЕсли Параметры.Состояние = Перечисления.СостоянияНеотправленныхДокументов.ДокументыБезВсехПодписей Тогда
			ТекстЗапросаДокументов = ИнтеграцияЕГИСЗ_РЭМД.ТекстЗапросаДокументыБезВсехПодписей();
			ЭтотОбъект.Заголовок = НСтр("ru='Не все подписи поставлены'");
		ИначеЕсли Параметры.Состояние = Перечисления.СостоянияНеотправленныхДокументов.ДокументыСНесформированнымиФайламиРЭМД Тогда
			ТекстЗапросаДокументов = ИнтеграцияЕГИСЗ_РЭМД.ТекстЗапросаДокументыСНесформированнымиФайламиРЭМД();
			ЭтотОбъект.Заголовок = НСтр("ru='Не сформированы файлы'");
		КонецЕсли;
	КонецЕсли;
	
	ТекстЗапроса = Новый Массив;
	ТекстЗапроса.Добавить(ТекстЗапросаДокументов);
	ТекстЗапроса.Добавить(ТекстЗапросаДанныхСоСтатусомЭП());
	
	Список.ТекстЗапроса = СтрСоединить(ТекстЗапроса, ";");
	
	Если Параметры.Свойство("ЗаСегодня") И Параметры.ЗаСегодня Тогда
		Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "&УсловиеЗаСегодня", "ДокументыРЭМД.ЗаСегодня");
	Иначе
		УстановитьПараметрСписка(Список, "УсловиеЗаСегодня", Истина);
	КонецЕсли;
	
	Если Параметры.Свойство("Филиал") И ЗначениеЗаполнено(Параметры.Филиал) Тогда
		Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "&УсловиеФилиал", "ДокументыРЭМД.Филиал = &Филиал");
		УстановитьПараметрСписка(Список, "Филиал", Параметры.Филиал);
	Иначе
		УстановитьПараметрСписка(Список, "УсловиеФилиал", Истина);
	КонецЕсли;
	
	УстановитьПараметрСписка(Список, "НачалоСегодняшнегоДня",				НачалоДня(ТекущаяДатаСеанса()));
	УстановитьПараметрСписка(Список, "ДатаНачалаОбменаСРЭМД",				ИнтеграцияЕГИСЗСерверПовтИсп.ПолучитьДатуНачалаОбменаИнформациейСРЭМД());
	УстановитьПараметрСписка(Список, "ВидДокументаВК",						ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ВидРЭМДВрачебнойКомиссии());
	
	Если Метаданные.Документы.Найти("ПрохождениеМедосмотра") <> Неопределено Тогда
		МодульМедосмотрыСервер = ДопСерверныеФункции.ОбщийМодуль("МедосмотрыСервер");
		УстановитьПараметрСписка(Список, "ПунктыВредныхФакторовДляМедкнижки",	МодульМедосмотрыСервер.ПунктыВредныхФакторовДляМедкнижки());
		УстановитьПараметрСписка(Список, "ВидЗаключенияДляМедкнижки",			ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.РегистрируемыеЭлектронныеМедДокументы(194));
		УстановитьПараметрСписка(Список, "ВидЗаключенияНеДляМедкнижки",			ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.РегистрируемыеЭлектронныеМедДокументы(103));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПоказатьЗначение(,Элемент.ТекущиеДанные.Документ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура УстановитьПараметрСписка(Список, ИмяПараметра, ЗначениеПараметра)
	
	Если Список.Параметры.ДоступныеПараметры.НайтиПараметр(Новый ПараметрКомпоновкиДанных(ИмяПараметра)) <> Неопределено Тогда
		Список.Параметры.УстановитьЗначениеПараметра(ИмяПараметра, ЗначениеПараметра);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекстЗапросаДанныхСоСтатусомЭП()
	
	Возврат 
		"ВЫБРАТЬ
		|	ДокументыРЭМД.Ссылка КАК Документ,
		|	ДокументыРЭМД.Дата КАК Дата,
		|	ДокументыРЭМД.Клиент КАК Клиент,
		|	ДокументыРЭМД.Врач КАК Врач,
		|	ДокументыРЭМД.Филиал КАК Филиал,
		|	ДокументыРЭМД.ЗаСегодня КАК ЗаСегодня,
		|	ВЫБОР
		|		КОГДА КешИнформацииОбОбъектах.СтатусЭП = ЗНАЧЕНИЕ(Перечисление.СтатусПроверкиЭП.ПодписиНет)
		|			ТОГДА 0
		|		КОГДА КешИнформацииОбОбъектах.СтатусЭП = ЗНАЧЕНИЕ(Перечисление.СтатусПроверкиЭП.ПодписьНеПроверена)
		|			ТОГДА 1
		|		КОГДА КешИнформацииОбОбъектах.СтатусЭП = ЗНАЧЕНИЕ(Перечисление.СтатусПроверкиЭП.ПодписьДействительна)
		|			ТОГДА 2
		|		КОГДА КешИнформацииОбОбъектах.СтатусЭП = ЗНАЧЕНИЕ(Перечисление.СтатусПроверкиЭП.ПодписьНедействительна)
		|			ТОГДА 3
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ДокументыРЭМД.ПодписанЭП
		|					ТОГДА 1
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|	КОНЕЦ КАК СтатусПроверкиЭП
		|ИЗ
		|	ДокументыРЭМД КАК ДокументыРЭМД
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КешИнформацииОбОбъектах КАК КешИнформацииОбОбъектах
		|		ПО (КешИнформацииОбОбъектах.Объект = ДокументыРЭМД.Ссылка)
		|ГДЕ
		|	&УсловиеЗаСегодня
		|	И &УсловиеФилиал";
	
КонецФункции

#КонецОбласти
